src/cf/Catalogs/desНастройкиДействийПриОбмене.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>desНастройкиДействийПриОбмене</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбщихПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяОтправка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.desВариантыНастроекОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.desДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗадание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОбработка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеСхемаИсточникаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКомпоновщикНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеПараметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЗначенияПоУмолчанию</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьПоЭлектроннойПочте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПолучателяУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/desВариантыНастроекОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>desВариантыНастроекОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбменСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменEDI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/desНастройкиДействийПриОбмене/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗаписьРегламентныхЗаданий();
	 
КонецПроцедуры

Процедура ВыполнитьЗаписьРегламентныхЗаданий()

	Если НЕ (ДополнительныеСвойства.Свойство("ЗаданияДляОбновления") 
		И ТипЗнч(ДополнительныеСвойства.ЗаданияДляОбновления) = Тип("Соответствие"))
		Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеЗадания Из ДополнительныеСвойства.ЗаданияДляОбновления Цикл	
		Задание = ОписаниеЗадания.Значение;
		Если Задание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗаданияДляОбновления = ОписаниеЗадания.Ключ;
		
		ПараметрыЗадания = Новый Структура;
	
		Если ПараметрыЗаданияДляОбновления.Свойство("Расписание") 
			И ТипЗнч(ПараметрыЗаданияДляОбновления.Расписание) = Тип("РасписаниеРегламентногоЗадания")
			И Строка(ПараметрыЗаданияДляОбновления.Расписание) <> Строка(Задание.Расписание) Тогда
			
			ПараметрыЗадания.Вставить("Расписание", ПараметрыЗаданияДляОбновления.Расписание);
			
		КонецЕсли;
		
		// Использование устанавливается в форме элемента
		Если ПометкаУдаления И Задание.Использование Тогда
			
			ПараметрыЗадания.Вставить("Использование", Ложь);
			
		ИначеЕсли ПараметрыЗаданияДляОбновления.Свойство("Использование") 
			И ПараметрыЗаданияДляОбновления.Использование <> Задание.Использование Тогда
			
			ПараметрыЗадания.Вставить("Использование", ПараметрыЗаданияДляОбновления.Использование);
			
		КонецЕсли;
		
		НаименованиеЗадания = НаименованиеРегламентногоЗадания(ПараметрыЗаданияДляОбновления.Действие);
		ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания);
		
		Параметры = Новый Массив;
		Параметры.Добавить(ПараметрыЗаданияДляОбновления.Действие);
		//{[-](фрагмент удален)Виноградов Дмитрий 19.02.2018 11:07:57 ID
		//Параметры.Добавить(Ссылка);
		//}Виноградов Дмитрий 19.02.2018 11:07:57
		//{[+](фрагмент добавлен), Виноградов Дмитрий Александрович 19.02.2018 11:09:00 ID
		//Параметры.Добавить(ПолучитьНастроекиДействия(ПараметрыЗаданияДляОбновления.Действие));
		//}Виноградов Дмитрий 19.02.2018 11:09:00
		ПараметрыЗадания.Вставить("Параметры", Параметры);
		ПараметрыЗадания.Вставить("Ключ", ПараметрыЗаданияДляОбновления.РегламентноеЗадание);
		
		УстановитьПривилегированныйРежим(Истина);
		desОбменДаннымиВызовСервера.ИзменитьЗадание(ПараметрыЗаданияДляОбновления.РегламентноеЗадание, ПараметрыЗадания);
	КонецЦикла;
	
КонецПроцедуры

//{[+](фрагмент добавлен), Виноградов Дмитрий Александрович 19.02.2018 11:10:07 ID

Функция НаименованиеРегламентногоЗадания(Действие)

	Возврат НСтр("ru = 'DSE '") + СокрЛП(Наименование) + ". " + Строка(Действие);

КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)//--> VOG Бей Вадим  05.12.2018 12:58:54 ID заявки:000002263
	
	Если ВариантОбмена = Перечисления.desВариантыНастроекОбмена.ОбменEDI Тогда
		//	
		НастройкиУПД = Действия.НайтиСтроки(Новый Структура("Действие",Справочники.desДействияПриОбмене.ЭДОУПД));
		Если НастройкиУПД.Количество()=0 Тогда
			
			ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ИдентификаторЭДО");
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
	
		КонецЕсли;
		
	ИначеЕсли ВариантОбмена = Перечисления.desВариантыНастроекОбмена.ОбменСКлиентом Тогда
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ПрофильОбмена");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ИдентификаторЭДО");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);   
		
	ИначеЕсли ВариантОбмена = Перечисления.desВариантыНастроекОбмена.Прочее Тогда
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ПрофильОбмена");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("Контрагент");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("Организация");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ИдентификаторЭДО");
		ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		СсылкаНового = Справочники.desНастройкиДействийПриОбмене.ПолучитьСсылку();
	    ЭтотОбъект.УстановитьСсылкуНового(СсылкаНового);
		ИдентификаторНастройки	= СсылкаНового.УникальныйИдентификатор();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ИдентификаторНастройки) Тогда
		ИдентификаторНастройки	= Ссылка.УникальныйИдентификатор();
	КонецЕсли; 
	
КонецПроцедуры
